[Killed] LogicalOperator
src/utils/deep-merge.ts:23:5
  */
 function isPlainObject(value: unknown): value is Record<string, unknown> {
   return (
-    typeof value === 'object' &&
-    value !== null &&
-    !Array.isArray(value) &&
-    Object.prototype.toString.call(value) === '[object Object]' &&
-    Object.getPrototypeOf(value) === Object.prototype
+    typeof value === 'object' && value !== null && !Array.isArray(value) && Object.prototype.toString.call(value) === '[object Object]' || Object.getPrototypeOf(value) === Object.prototype
   );
 }
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

68 | function isPlainObject(value: unknown): value is Record<string, unknown> {
69 |   if (stryMutAct_9fa48("0")) {
70 |     {}

[Killed] ConditionalExpression
src/utils/deep-merge.ts:23:5
  */
 function isPlainObject(value: unknown): value is Record<string, unknown> {
   return (
-    typeof value === 'object' &&
-    value !== null &&
-    !Array.isArray(value) &&
-    Object.prototype.toString.call(value) === '[object Object]' &&
-    Object.getPrototypeOf(value) === Object.prototype
+    true
   );
 }
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

117 |       if (stryMutAct_9fa48("34")) {
118 |         {}

[Killed] BooleanLiteral
src/utils/deep-merge.ts:25:5
   return (
     typeof value === 'object' &&
     value !== null &&
-    !Array.isArray(value) &&
+    Array.isArray(value) &&
     Object.prototype.toString.call(value) === '[object Object]' &&
     Object.getPrototypeOf(value) === Object.prototype
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

21 |   describe('P0 - Critical Merge Logic', () => {
22 |     it('should merge two simple objects', () => {
23 |       const base = { a: 1, b: 2 } as Record<string, unknown>;

[Killed] EqualityOperator
src/utils/deep-merge.ts:26:5
     typeof value === 'object' &&
     value !== null &&
     !Array.isArray(value) &&
-    Object.prototype.toString.call(value) === '[object Object]' &&
+    Object.prototype.toString.call(value) !== '[object Object]' &&
     Object.getPrototypeOf(value) === Object.prototype
   );
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

21 |   describe('P0 - Critical Merge Logic', () => {
22 |     it('should merge two simple objects', () => {
23 |       const base = { a: 1, b: 2 } as Record<string, unknown>;

[Killed] ConditionalExpression
src/utils/deep-merge.ts:26:5
     typeof value === 'object' &&
     value !== null &&
     !Array.isArray(value) &&
-    Object.prototype.toString.call(value) === '[object Object]' &&
+    true &&
     Object.getPrototypeOf(value) === Object.prototype
   );
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Merge Logic > should merge two simple objects [0.39ms]
(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Merge Logic > should return base when override is empty [0.09ms]
(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Mer

[Killed] ConditionalExpression
src/utils/deep-merge.ts:27:5
     value !== null &&
     !Array.isArray(value) &&
     Object.prototype.toString.call(value) === '[object Object]' &&
-    Object.getPrototypeOf(value) === Object.prototype
+    true
   );
 }
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Merge Logic > should merge two simple objects [0.57ms]

(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Merge Logic > should return base when override is empty [0.05ms]

[Killed] EqualityOperator
src/utils/deep-merge.ts:27:5
     value !== null &&
     !Array.isArray(value) &&
     Object.prototype.toString.call(value) === '[object Object]' &&
-    Object.getPrototypeOf(value) === Object.prototype
+    Object.getPrototypeOf(value) !== Object.prototype
   );
 }
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

21 |   describe('P0 - Critical Merge Logic', () => {
22 |     it('should merge two simple objects', () => {
23 |       const base = { a: 1, b: 2 } as Record<string, unknown>;

[Killed] BlockStatement
src/utils/deep-merge.ts:58:75
  * Validates merge inputs
  * @param base - Base object
  */
-function validateInputs<T extends Record<string, unknown>>(base: T): void {
-  if (typeof base !== 'object' || base === null || Array.isArray(base)) {
-    throw new TypeError('Base must be an object');
-  }
-}
+function validateInputs<T extends Record<string, unknown>>(base: T): void {}
 
 /**
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Merge Logic > should merge two simple objects [0.40ms]

(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Merge Logic > should return base when override is empty [0.04ms]

[Killed] LogicalOperator
src/utils/deep-merge.ts:59:7
  * @param base - Base object
  */
 function validateInputs<T extends Record<string, unknown>>(base: T): void {
-  if (typeof base !== 'object' || base === null || Array.isArray(base)) {
+  if ((typeof base !== 'object' || base === null) && Array.isArray(base)) {
     throw new TypeError('Base must be an object');
   }
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Merge Logic > should merge two simple objects [0.46ms]
(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Merge Logic > should return base when override is empty [0.03ms]
(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Mer

[Killed] ConditionalExpression
src/utils/deep-merge.ts:59:35
  * @param base - Base object
  */
 function validateInputs<T extends Record<string, unknown>>(base: T): void {
-  if (typeof base !== 'object' || base === null || Array.isArray(base)) {
+  if (typeof base !== 'object' || false || Array.isArray(base)) {
     throw new TypeError('Base must be an object');
   }
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Merge Logic > should merge two simple objects [0.94ms]
(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Merge Logic > should return base when override is empty [0.07ms]

[Killed] BlockStatement
src/utils/deep-merge.ts:72:9
 function mergeKeys<T extends Record<string, unknown>>(
   result: Record<string, unknown>,
   override: Partial<T>
-): void {
-  if (!isPlainObject(override)) {
-    return;
-  }
-
-  for (const key in override) {
-    if (!Object.prototype.hasOwnProperty.call(override, key)) {
-      continue;
-    }
-    mergeKey(result, key, override[key]);
-  }
-}
+): void {}
 
 /**
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

21 |   describe('P0 - Critical Merge Logic', () => {
22 |     it('should merge two simple objects', () => {
23 |       const base = { a: 1, b: 2 } as Record<string, unknown>;

[Killed] ConditionalExpression
src/utils/deep-merge.ts:73:7
   result: Record<string, unknown>,
   override: Partial<T>
 ): void {
-  if (!isPlainObject(override)) {
+  if (true) {
     return;
   }
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

21 |   describe('P0 - Critical Merge Logic', () => {
22 |     it('should merge two simple objects', () => {
23 |       const base = { a: 1, b: 2 } as Record<string, unknown>;

[Killed] ConditionalExpression
src/utils/deep-merge.ts:73:7
   result: Record<string, unknown>,
   override: Partial<T>
 ): void {
-  if (!isPlainObject(override)) {
+  if (false) {
     return;
   }
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Merge Logic > should merge two simple objects [0.36ms]

(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Merge Logic > should return base when override is empty [0.07ms]

[Killed] BlockStatement
src/utils/deep-merge.ts:77:31
     return;
   }
 
-  for (const key in override) {
-    if (!Object.prototype.hasOwnProperty.call(override, key)) {
-      continue;
-    }
-    mergeKey(result, key, override[key]);
-  }
+  for (const key in override) {}
 }
 
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

21 |   describe('P0 - Critical Merge Logic', () => {
22 |     it('should merge two simple objects', () => {
23 |       const base = { a: 1, b: 2 } as Record<string, unknown>;

[Killed] BooleanLiteral
src/utils/deep-merge.ts:78:9
   }
 
   for (const key in override) {
-    if (!Object.prototype.hasOwnProperty.call(override, key)) {
+    if (Object.prototype.hasOwnProperty.call(override, key)) {
       continue;
     }
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

21 |   describe('P0 - Critical Merge Logic', () => {
22 |     it('should merge two simple objects', () => {
23 |       const base = { a: 1, b: 2 } as Record<string, unknown>;

[Killed] ConditionalExpression
src/utils/deep-merge.ts:78:9
   }
 
   for (const key in override) {
-    if (!Object.prototype.hasOwnProperty.call(override, key)) {
+    if (true) {
       continue;
     }
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

21 |   describe('P0 - Critical Merge Logic', () => {
22 |     it('should merge two simple objects', () => {
23 |       const base = { a: 1, b: 2 } as Record<string, unknown>;

[Killed] BlockStatement
src/utils/deep-merge.ts:91:95
  * @param key - Key to merge
  * @param overrideValue - Override value
  */
-function mergeKey(result: Record<string, unknown>, key: string, overrideValue: unknown): void {
-  if (overrideValue === undefined) {
-    return;
-  }
-
-  const baseValue = result[key];
-  const shouldMergeRecursively = isPlainObject(baseValue) && isPlainObject(overrideValue);
-
-  result[key] = shouldMergeRecursively
-    ? deepMerge(baseValue as Record<string, unknown>, overrideValue as Record<string, unknown>)
-    : overrideValue;
-}
+function mergeKey(result: Record<string, unknown>, key: string, overrideValue: unknown): void {}
 
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

21 |   describe('P0 - Critical Merge Logic', () => {
22 |     it('should merge two simple objects', () => {
23 |       const base = { a: 1, b: 2 } as Record<string, unknown>;

[Killed] ConditionalExpression
src/utils/deep-merge.ts:92:7
  * @param overrideValue - Override value
  */
 function mergeKey(result: Record<string, unknown>, key: string, overrideValue: unknown): void {
-  if (overrideValue === undefined) {
+  if (false) {
     return;
   }
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Merge Logic > should merge two simple objects [0.42ms]
(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Merge Logic > should return base when override is empty [0.06ms]
(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Mer

[Killed] EqualityOperator
src/utils/deep-merge.ts:92:7
  * @param overrideValue - Override value
  */
 function mergeKey(result: Record<string, unknown>, key: string, overrideValue: unknown): void {
-  if (overrideValue === undefined) {
+  if (overrideValue !== undefined) {
     return;
   }
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

21 |   describe('P0 - Critical Merge Logic', () => {
22 |     it('should merge two simple objects', () => {
23 |       const base = { a: 1, b: 2 } as Record<string, unknown>;

[Killed] ConditionalExpression
src/utils/deep-merge.ts:97:34
   }
 
   const baseValue = result[key];
-  const shouldMergeRecursively = isPlainObject(baseValue) && isPlainObject(overrideValue);
+  const shouldMergeRecursively = false;
 
   result[key] = shouldMergeRecursively
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Merge Logic > should merge two simple objects [0.35ms]
(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Merge Logic > should return base when override is empty [0.02ms]
(pass) Story 1.2 - AC3: Configuration System Deep Merge > P0 - Critical Mer

[Killed] ConditionalExpression
src/utils/deep-merge.ts:97:34
   }
 
   const baseValue = result[key];
-  const shouldMergeRecursively = isPlainObject(baseValue) && isPlainObject(overrideValue);
+  const shouldMergeRecursively = true;
 
   result[key] = shouldMergeRecursively
killedBy: All tests
statusReason: bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

117 |       if (stryMutAct_9fa48("34")) {
118 |         {}
