[Survived] StringLiteral
src/config/defaults.ts:16:17
  */
 export const DEFAULT_CONFIG: Config = {
   version: 1,
-  qualityLevel: 'strict',
+  qualityLevel: "",
   aiAssistants: ['claude-code'],
   tools: {

[Killed] StringLiteral
src/config/defaults.ts:17:18
 export const DEFAULT_CONFIG: Config = {
   version: 1,
   qualityLevel: 'strict',
-  aiAssistants: ['claude-code'],
+  aiAssistants: [""],
   tools: {
     eslint: {
killedBy: All tests
statusReason: > @nimata/core@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

[Survived] ObjectLiteral
src/config/defaults.ts:19:13
   qualityLevel: 'strict',
   aiAssistants: ['claude-code'],
   tools: {
-    eslint: {
-      enabled: true,
-      configPath: '.eslintrc.json',
-    },
+    eslint: {},
     typescript: {
       enabled: true,

[Survived] BooleanLiteral
src/config/defaults.ts:20:16
   aiAssistants: ['claude-code'],
   tools: {
     eslint: {
-      enabled: true,
+      enabled: false,
       configPath: '.eslintrc.json',
     },

[Killed] StringLiteral
src/config/defaults.ts:21:19
   tools: {
     eslint: {
       enabled: true,
-      configPath: '.eslintrc.json',
+      configPath: "",
     },
     typescript: {
killedBy: All tests
statusReason: > @nimata/core@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

[Survived] ObjectLiteral
src/config/defaults.ts:23:17
       enabled: true,
       configPath: '.eslintrc.json',
     },
-    typescript: {
-      enabled: true,
-      configPath: 'tsconfig.json',
-      strict: true,
-      target: 'ES2022',
-    },
+    typescript: {},
     prettier: {
       enabled: true,

[Survived] BooleanLiteral
src/config/defaults.ts:24:16
       configPath: '.eslintrc.json',
     },
     typescript: {
-      enabled: true,
+      enabled: false,
       configPath: 'tsconfig.json',
       strict: true,

[Survived] BooleanLiteral
src/config/defaults.ts:26:15
     typescript: {
       enabled: true,
       configPath: 'tsconfig.json',
-      strict: true,
+      strict: false,
       target: 'ES2022',
     },

[Killed] StringLiteral
src/config/defaults.ts:27:15
       enabled: true,
       configPath: 'tsconfig.json',
       strict: true,
-      target: 'ES2022',
+      target: "",
     },
     prettier: {
killedBy: All tests
statusReason: > @nimata/core@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

[Survived] ObjectLiteral
src/config/defaults.ts:29:15
       strict: true,
       target: 'ES2022',
     },
-    prettier: {
-      enabled: true,
-      configPath: '.prettierrc.json',
-    },
+    prettier: {},
     bunTest: {
       enabled: true,

[Survived] BooleanLiteral
src/config/defaults.ts:30:16
       target: 'ES2022',
     },
     prettier: {
-      enabled: true,
+      enabled: false,
       configPath: '.prettierrc.json',
     },

[Survived] BooleanLiteral
src/config/defaults.ts:34:16
       configPath: '.prettierrc.json',
     },
     bunTest: {
-      enabled: true,
+      enabled: false,
       coverage: true,
       coverageThreshold: 80,

[Survived] BooleanLiteral
src/config/defaults.ts:35:17
     },
     bunTest: {
       enabled: true,
-      coverage: true,
+      coverage: false,
       coverageThreshold: 80,
     },

[Survived] ObjectLiteral
src/config/defaults.ts:39:16
       coverageThreshold: 80,
     },
   },
-  scaffolding: {
-    templateDirectory: 'templates',
-    includeExamples: true,
-    initializeGit: true,
-    installDependencies: true,
-  },
+  scaffolding: {},
   validation: {
     cache: true,

[Survived] BooleanLiteral
src/config/defaults.ts:41:22
   },
   scaffolding: {
     templateDirectory: 'templates',
-    includeExamples: true,
+    includeExamples: false,
     initializeGit: true,
     installDependencies: true,

[Survived] BooleanLiteral
src/config/defaults.ts:42:20
   scaffolding: {
     templateDirectory: 'templates',
     includeExamples: true,
-    initializeGit: true,
+    initializeGit: false,
     installDependencies: true,
   },

[Survived] BooleanLiteral
src/config/defaults.ts:43:26
     templateDirectory: 'templates',
     includeExamples: true,
     initializeGit: true,
-    installDependencies: true,
+    installDependencies: false,
   },
   validation: {

[Survived] ObjectLiteral
src/config/defaults.ts:45:15
     initializeGit: true,
     installDependencies: true,
   },
-  validation: {
-    cache: true,
-    parallel: true,
-  },
+  validation: {},
   refactoring: {
     preview: true,

[Survived] BooleanLiteral
src/config/defaults.ts:46:12
     installDependencies: true,
   },
   validation: {
-    cache: true,
+    cache: false,
     parallel: true,
   },

[Survived] BooleanLiteral
src/config/defaults.ts:47:15
   },
   validation: {
     cache: true,
-    parallel: true,
+    parallel: false,
   },
   refactoring: {

[Killed] BooleanLiteral
src/config/defaults.ts:50:14
     parallel: true,
   },
   refactoring: {
-    preview: true,
+    preview: false,
   },
   logging: {
killedBy: All tests
statusReason: > @nimata/core@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

[Survived] StringLiteral
src/config/defaults.ts:54:18
   },
   logging: {
     level: 'info',
-    destination: '~/.nimata/logs/nimata.log',
+    destination: "",
   },
 };
