[Survived] ArrayDeclaration
src/types/config.ts:6:36
 /**
  * Quality level determines the strictness of code quality checks
  */
-export const QualityLevel = z.enum(['light', 'medium', 'strict']);
+export const QualityLevel = z.enum([]);
 export type QualityLevel = z.infer<typeof QualityLevel>;
 

[Survived] StringLiteral
src/types/config.ts:6:46
 /**
  * Quality level determines the strictness of code quality checks
  */
-export const QualityLevel = z.enum(['light', 'medium', 'strict']);
+export const QualityLevel = z.enum(['light', "", 'strict']);
 export type QualityLevel = z.infer<typeof QualityLevel>;
 

[Survived] MethodExpression
src/types/config.ts:53:22
 export const BunTestConfigSchema = z.object({
   enabled: z.boolean().optional(),
   coverage: z.boolean().optional(),
-  coverageThreshold: z.number().min(MIN_COVERAGE).max(MAX_COVERAGE).optional(),
+  coverageThreshold: z.number().min(MIN_COVERAGE).min(MAX_COVERAGE).optional(),
 });
 export type BunTestConfig = z.infer<typeof BunTestConfigSchema>;

[Survived] MethodExpression
src/types/config.ts:53:22
 export const BunTestConfigSchema = z.object({
   enabled: z.boolean().optional(),
   coverage: z.boolean().optional(),
-  coverageThreshold: z.number().min(MIN_COVERAGE).max(MAX_COVERAGE).optional(),
+  coverageThreshold: z.number().max(MIN_COVERAGE).max(MAX_COVERAGE).optional(),
 });
 export type BunTestConfig = z.infer<typeof BunTestConfigSchema>;

[Killed] ObjectLiteral
src/types/config.ts:82:48
 /**
  * Validation configuration options
  */
-export const ValidationConfigSchema = z.object({
-  cache: z.boolean().optional(),
-  parallel: z.boolean().optional(),
-});
+export const ValidationConfigSchema = z.object({});
 export type ValidationConfig = z.infer<typeof ValidationConfigSchema>;
 
killedBy: All tests
statusReason: > @nimata/core@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

[Survived] ObjectLiteral
src/types/config.ts:91:49
 /**
  * Refactoring configuration options
  */
-export const RefactoringConfigSchema = z.object({
-  preview: z.boolean().optional(),
-});
+export const RefactoringConfigSchema = z.object({});
 export type RefactoringConfig = z.infer<typeof RefactoringConfigSchema>;
 

[Survived] StringLiteral
src/types/config.ts:100:27
  * Logging configuration options
  */
 export const LoggingConfigSchema = z.object({
-  level: z.enum(['trace', 'debug', 'info', 'warn', 'error', 'fatal']).optional(),
+  level: z.enum(['trace', "", 'info', 'warn', 'error', 'fatal']).optional(),
   destination: z.string().optional(),
 });

[Survived] StringLiteral
src/types/config.ts:100:36
  * Logging configuration options
  */
 export const LoggingConfigSchema = z.object({
-  level: z.enum(['trace', 'debug', 'info', 'warn', 'error', 'fatal']).optional(),
+  level: z.enum(['trace', 'debug', "", 'warn', 'error', 'fatal']).optional(),
   destination: z.string().optional(),
 });

[Survived] ObjectLiteral
src/types/config.ts:114:38
  * - AI assistants must be from supported list
  * - Coverage threshold must be 0-100
  */
-export const ConfigSchema = z.object({
-  version: z.number().int().positive().default(1),
-  qualityLevel: QualityLevel.default('strict'),
-  aiAssistants: z.array(AIAssistant).default(['claude-code']),
-  tools: ToolsConfigSchema.default({}),
-  scaffolding: ScaffoldingConfigSchema.default({}),
-  validation: ValidationConfigSchema.default({}),
-  refactoring: RefactoringConfigSchema.default({}),
-  logging: LoggingConfigSchema.default({}),
-});
+export const ConfigSchema = z.object({});
 
 export type Config = z.infer<typeof ConfigSchema>;

[Survived] StringLiteral
src/types/config.ts:116:38
  */
 export const ConfigSchema = z.object({
   version: z.number().int().positive().default(1),
-  qualityLevel: QualityLevel.default('strict'),
+  qualityLevel: QualityLevel.default(""),
   aiAssistants: z.array(AIAssistant).default(['claude-code']),
   tools: ToolsConfigSchema.default({}),

[Survived] StringLiteral
src/types/config.ts:117:47
 export const ConfigSchema = z.object({
   version: z.number().int().positive().default(1),
   qualityLevel: QualityLevel.default('strict'),
-  aiAssistants: z.array(AIAssistant).default(['claude-code']),
+  aiAssistants: z.array(AIAssistant).default([""]),
   tools: ToolsConfigSchema.default({}),
   scaffolding: ScaffoldingConfigSchema.default({}),

[Survived] ArrayDeclaration
src/types/config.ts:117:46
 export const ConfigSchema = z.object({
   version: z.number().int().positive().default(1),
   qualityLevel: QualityLevel.default('strict'),
-  aiAssistants: z.array(AIAssistant).default(['claude-code']),
+  aiAssistants: z.array(AIAssistant).default([]),
   tools: ToolsConfigSchema.default({}),
   scaffolding: ScaffoldingConfigSchema.default({}),

[Survived] BlockStatement
src/types/config.ts:132:63
  * @param config - Configuration object to validate
  * @returns Array of validation error messages (empty if valid)
  */
-export function validateConfigPaths(config: Config): string[] {
-  const errors: string[] = [];
-
-  const checkPath = (path: string | undefined, fieldPath: string): void => {
-    if (path && (path.startsWith('/') || path.includes('..'))) {
-      errors.push(
-        `${fieldPath}: Absolute paths and parent directory references are not allowed (got: ${path})`
-      );
-    }
-  };
-
-  checkPath(config.tools?.eslint?.configPath, 'tools.eslint.configPath');
-  checkPath(config.tools?.typescript?.configPath, 'tools.typescript.configPath');
-  checkPath(config.tools?.prettier?.configPath, 'tools.prettier.configPath');
-  checkPath(config.scaffolding?.templateDirectory, 'scaffolding.templateDirectory');
-  checkPath(config.logging?.destination, 'logging.destination');
-
-  return errors;
-}
+export function validateConfigPaths(config: Config): string[] {}
 

[Survived] BlockStatement
src/types/config.ts:135:76
 export function validateConfigPaths(config: Config): string[] {
   const errors: string[] = [];
 
-  const checkPath = (path: string | undefined, fieldPath: string): void => {
-    if (path && (path.startsWith('/') || path.includes('..'))) {
-      errors.push(
-        `${fieldPath}: Absolute paths and parent directory references are not allowed (got: ${path})`
-      );
-    }
-  };
+  const checkPath = (path: string | undefined, fieldPath: string): void => {};
 
   checkPath(config.tools?.eslint?.configPath, 'tools.eslint.configPath');

[Survived] LogicalOperator
src/types/config.ts:136:18
   const errors: string[] = [];
 
   const checkPath = (path: string | undefined, fieldPath: string): void => {
-    if (path && (path.startsWith('/') || path.includes('..'))) {
+    if (path && (path.startsWith('/') && path.includes('..'))) {
       errors.push(
         `${fieldPath}: Absolute paths and parent directory references are not allowed (got: ${path})`

[Survived] ConditionalExpression
src/types/config.ts:136:18
   const errors: string[] = [];
 
   const checkPath = (path: string | undefined, fieldPath: string): void => {
-    if (path && (path.startsWith('/') || path.includes('..'))) {
+    if (path && (true)) {
       errors.push(
         `${fieldPath}: Absolute paths and parent directory references are not allowed (got: ${path})`

[Survived] StringLiteral
src/types/config.ts:138:9
   const checkPath = (path: string | undefined, fieldPath: string): void => {
     if (path && (path.startsWith('/') || path.includes('..'))) {
       errors.push(
-        `${fieldPath}: Absolute paths and parent directory references are not allowed (got: ${path})`
+        ``
       );
     }

[Survived] OptionalChaining
src/types/config.ts:143:13
     }
   };
 
-  checkPath(config.tools?.eslint?.configPath, 'tools.eslint.configPath');
+  checkPath(config.tools?.eslint.configPath, 'tools.eslint.configPath');
   checkPath(config.tools?.typescript?.configPath, 'tools.typescript.configPath');
   checkPath(config.tools?.prettier?.configPath, 'tools.prettier.configPath');

[Survived] OptionalChaining
src/types/config.ts:143:13
     }
   };
 
-  checkPath(config.tools?.eslint?.configPath, 'tools.eslint.configPath');
+  checkPath(config.tools.eslint?.configPath, 'tools.eslint.configPath');
   checkPath(config.tools?.typescript?.configPath, 'tools.typescript.configPath');
   checkPath(config.tools?.prettier?.configPath, 'tools.prettier.configPath');

[Survived] OptionalChaining
src/types/config.ts:144:13
   };
 
   checkPath(config.tools?.eslint?.configPath, 'tools.eslint.configPath');
-  checkPath(config.tools?.typescript?.configPath, 'tools.typescript.configPath');
+  checkPath(config.tools.typescript?.configPath, 'tools.typescript.configPath');
   checkPath(config.tools?.prettier?.configPath, 'tools.prettier.configPath');
   checkPath(config.scaffolding?.templateDirectory, 'scaffolding.templateDirectory');

[Survived] OptionalChaining
src/types/config.ts:144:13
   };
 
   checkPath(config.tools?.eslint?.configPath, 'tools.eslint.configPath');
-  checkPath(config.tools?.typescript?.configPath, 'tools.typescript.configPath');
+  checkPath(config.tools?.typescript.configPath, 'tools.typescript.configPath');
   checkPath(config.tools?.prettier?.configPath, 'tools.prettier.configPath');
   checkPath(config.scaffolding?.templateDirectory, 'scaffolding.templateDirectory');

[Survived] OptionalChaining
src/types/config.ts:145:13
 
   checkPath(config.tools?.eslint?.configPath, 'tools.eslint.configPath');
   checkPath(config.tools?.typescript?.configPath, 'tools.typescript.configPath');
-  checkPath(config.tools?.prettier?.configPath, 'tools.prettier.configPath');
+  checkPath(config.tools.prettier?.configPath, 'tools.prettier.configPath');
   checkPath(config.scaffolding?.templateDirectory, 'scaffolding.templateDirectory');
   checkPath(config.logging?.destination, 'logging.destination');

[Survived] OptionalChaining
src/types/config.ts:145:13
 
   checkPath(config.tools?.eslint?.configPath, 'tools.eslint.configPath');
   checkPath(config.tools?.typescript?.configPath, 'tools.typescript.configPath');
-  checkPath(config.tools?.prettier?.configPath, 'tools.prettier.configPath');
+  checkPath(config.tools?.prettier.configPath, 'tools.prettier.configPath');
   checkPath(config.scaffolding?.templateDirectory, 'scaffolding.templateDirectory');
   checkPath(config.logging?.destination, 'logging.destination');

[Survived] OptionalChaining
src/types/config.ts:146:13
   checkPath(config.tools?.eslint?.configPath, 'tools.eslint.configPath');
   checkPath(config.tools?.typescript?.configPath, 'tools.typescript.configPath');
   checkPath(config.tools?.prettier?.configPath, 'tools.prettier.configPath');
-  checkPath(config.scaffolding?.templateDirectory, 'scaffolding.templateDirectory');
+  checkPath(config.scaffolding.templateDirectory, 'scaffolding.templateDirectory');
   checkPath(config.logging?.destination, 'logging.destination');
 

[Survived] OptionalChaining
src/types/config.ts:147:13
   checkPath(config.tools?.typescript?.configPath, 'tools.typescript.configPath');
   checkPath(config.tools?.prettier?.configPath, 'tools.prettier.configPath');
   checkPath(config.scaffolding?.templateDirectory, 'scaffolding.templateDirectory');
-  checkPath(config.logging?.destination, 'logging.destination');
+  checkPath(config.logging.destination, 'logging.destination');
 
   return errors;
