[Killed] BlockStatement
src/utils/deep-merge.ts:21:74
  * @param value - Value to check
  * @returns True if value is a plain object
  */
-function isPlainObject(value: unknown): value is Record<string, unknown> {
-  return (
-    typeof value === 'object' &&
-    value !== null &&
-    !Array.isArray(value) &&
-    Object.prototype.toString.call(value) === '[object Object]'
-  );
-}
+function isPlainObject(value: unknown): value is Record<string, unknown> {}
 
 /**
killedBy: All tests
statusReason: > @nimata/core@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

[Killed] ConditionalExpression
src/utils/deep-merge.ts:23:5
  */
 function isPlainObject(value: unknown): value is Record<string, unknown> {
   return (
-    typeof value === 'object' &&
-    value !== null &&
-    !Array.isArray(value) &&
-    Object.prototype.toString.call(value) === '[object Object]'
+    true
   );
 }
killedBy: All tests
statusReason: > @nimata/core@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

[Killed] EqualityOperator
src/utils/deep-merge.ts:26:5
     typeof value === 'object' &&
     value !== null &&
     !Array.isArray(value) &&
-    Object.prototype.toString.call(value) === '[object Object]'
+    Object.prototype.toString.call(value) !== '[object Object]'
   );
 }
killedBy: All tests
statusReason: > @nimata/core@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

[Killed] ConditionalExpression
src/utils/deep-merge.ts:26:5
     typeof value === 'object' &&
     value !== null &&
     !Array.isArray(value) &&
-    Object.prototype.toString.call(value) === '[object Object]'
+    true
   );
 }
killedBy: All tests
statusReason: > @nimata/core@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

[Killed] BlockStatement
src/utils/deep-merge.ts:46:96
  * // Result: { tools: { eslint: { enabled: true, configPath: 'b.json' } } }
  * ```
  */
-export function deepMerge<T extends Record<string, unknown>>(base: T, override: Partial<T>): T {
-  validateInputs(base);
-  const result: Record<string, unknown> = { ...base };
-  mergeKeys(result, override);
-  return result as T;
-}
+export function deepMerge<T extends Record<string, unknown>>(base: T, override: Partial<T>): T {}
 
 /**
killedBy: All tests
statusReason: > @nimata/core@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

[Killed] BlockStatement
src/utils/deep-merge.ts:57:75
  * Validates merge inputs
  * @param base - Base object
  */
-function validateInputs<T extends Record<string, unknown>>(base: T): void {
-  if (!isPlainObject(base)) {
-    throw new TypeError('Base must be a plain object');
-  }
-}
+function validateInputs<T extends Record<string, unknown>>(base: T): void {}
 
 /**
killedBy: All tests
statusReason: > @nimata/core@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

[Killed] BooleanLiteral
src/utils/deep-merge.ts:58:7
  * @param base - Base object
  */
 function validateInputs<T extends Record<string, unknown>>(base: T): void {
-  if (!isPlainObject(base)) {
+  if (isPlainObject(base)) {
     throw new TypeError('Base must be a plain object');
   }
killedBy: All tests
statusReason: > @nimata/core@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

[Killed] ConditionalExpression
src/utils/deep-merge.ts:58:7
  * @param base - Base object
  */
 function validateInputs<T extends Record<string, unknown>>(base: T): void {
-  if (!isPlainObject(base)) {
+  if (true) {
     throw new TypeError('Base must be a plain object');
   }
killedBy: All tests
statusReason: > @nimata/core@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

[Survived] StringLiteral
src/utils/deep-merge.ts:59:25
  */
 function validateInputs<T extends Record<string, unknown>>(base: T): void {
   if (!isPlainObject(base)) {
-    throw new TypeError('Base must be a plain object');
+    throw new TypeError("");
   }
 }

[Killed] ConditionalExpression
src/utils/deep-merge.ts:91:7
  * @param overrideValue - Override value
  */
 function mergeKey(result: Record<string, unknown>, key: string, overrideValue: unknown): void {
-  if (overrideValue === undefined) {
+  if (true) {
     return;
   }
killedBy: All tests
statusReason: > @nimata/core@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:

[Killed] BlockStatement
src/utils/deep-merge.ts:91:36
  * @param overrideValue - Override value
  */
 function mergeKey(result: Record<string, unknown>, key: string, overrideValue: unknown): void {
-  if (overrideValue === undefined) {
-    return;
-  }
+  if (overrideValue === undefined) {}
 
   const baseValue = result[key];
killedBy: All tests
statusReason: > @nimata/core@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/unit/deep-merge.test.ts:
